# Задача 1 (2): Найдите сумму цифр трехзначного числа.

print('Введите трехЗначное число: ')
a = input()
a1 = int (a[0])
a2 = int (a[1])
a3 = int (a[2])
print(f"Сумма трех цифр числа {a} равна ---> {a1 + a2 + a3}")